---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizes.GetCableTraySizes(Autodesk.Revit.DB.Document)
source: html/ed9b68ba-8759-16ad-e8e7-7d2c363c2662.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizes.GetCableTraySizes Method

Gets the cable tray sizes of the project.

## Syntax (C#)
```csharp
public static CableTraySizes GetCableTraySizes(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The cable tray sizes of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null